const system_analiz = [
  {
    "_id": "6089be24b506e11fd4150664",
    "A": {
    "text": "1 Семестр"
  },
  "B": {
  "text": "2 Семестр"
  },
  "C": {
  "text": "3 Семестр"
  },
  "D": {
  "text": "4 Семестр"
  },
  "E": {
  "text": "5 Семестр"
  },
  "F": {
  "text": "6 Семестр"
  },
  "G": {
  "text": "7 Семестр"
  },
  "H": {
  "text": "8 Семестр"
  },
  "__v": 0
  },
  {
  "_id": "6089be2cb506e11fd4150665",
  "A": {
  "text": "Філософія",
  "color": "#FADF9D"
  },
  "B": {
  "text": "Ділова українська мова",
  "color": "#FADF9D"
  },
  "C": {
  "text": "Іноземна мова",
  "color": "#FADF9D"
  },
  "D": {
  "text": "Іноземна мова",
  "color": "#FADF9D"
  },
  "E": {
  "text": "Іноземна мова",
  "color": "#FADF9D"
  },
  "F": {
  "text": "Охорона праці в IT індустрії / Безпека життєдіяльності / Англійська мова для професійної комунікації",
  "color": "#FADF9D"
  },
  "G": {
  "text": "Основи логістики / Політологія  / Практичний курс англійської мови",
  "color": "#FADF9D"
  },
  "H": {
  "text": "Основи англомовного ділового спілкування / Бізнес-англійська",
  "color": "#FADF9D"
  },
  "__v": 0
  },
  {
  "_id": "6089be33b506e11fd4150666",
  "A": {
  "text": "Математичний аналіз",
  "color": "#AEC0CA"
  },
  "B": {
  "text": "Історія та культура України",
  "color": "#FADF9D"
  },
  "C": {
  "text": "Математичний аналіз",
  "color": "#AEC0CA"
  },
  "D": {
  "text": "Ораторське мистецтво та спічрайтинг / Ефективне лідерство",
  "color": "#FADF9D"
  },
  "E": {
  "text": "Чисельні методи та моделювання на ЕОМ",
  "color": "#AEC0CA"
  },
  "F": {
  "text": "Теорія нечітких множин",
  "color": "#BED5AC"
  },
  "G": {
  "text": "Право інтелектуальної власності / Нормативо - правове забезпечення в IT індустрії",
  "color": "#FADF9D"
  },
  "H": {
  "text": "Аналіз даних. Big Data",
  "color": "#BED5AC"
  },
  "__v": 0
  },
  {
  "_id": "6089be3cb506e11fd4150667",
  "A": {
  "text": "Алгебра і геометрія",
  "color": "#AEC0CA"
  },
  "B": {
  "text": "Математичний аналіз",
  "color": "#AEC0CA"
  },
  "C": {
  "text": "Диференціальні рівняння",
  "color": "#AEC0CA"
  },
  "D": {
  "text": "Теорія ймовірностей та математична статистика",
  "color": "#AEC0CA"
  },
  "E": {
  "text": "Архітектура обчислювальних систем",
  "color": "#BED5AC"
  },
  "F": {
  "text": "Проблеми моделювання систем дискретної оптимізації",
  "color": "#AEC0CA"
  },
  "G": {
  "text": "Бізнес-аналіз / Технології розробки стартапів",
  "color": "#FADF9D"
  },
  "H": {
  "text": "Системи та методи прийняття рішень",
  "color": "#BED5AC"
  },
  "__v": 0
  },
  {
  "_id": "6089be43b506e11fd4150668",
  "A": {
  "text": "Дискретна математика та математична логіка",
  "color": "#AEC0CA"
  },
  "B": {
  "text": "Алгебра і геометрія",
  "color": "#AEC0CA"
  },
  "C": {
  "text": "База даних та проектування інформаційних систем",
  "color": "#AEC0CA"
  },
  "D": {
  "text": "Комп'ютерне моделювання",
  "color": "#AEC0CA"
  },
  "E": {
  "text": "Методи оптимізації та дослідження операцій",
  "color": "#BED5AC"
  },
  "F": {
  "text": "Використання сучасних комп'ютерних систем моделювання / 3D моделювання. Unity 3D",
  "color": "#FBD1B9"
  },
  "G": {
  "text": "Цифрова обробка інформації та розпізнавання образів",
  "color": "#AEC0CA"
  },
  "H": {
  "text": "Моделі системної оптимізації / Математичні основи дослідження операцій",
  "color": "#FBD1B9"
  },
  "__v": 0
  },
  {
  "_id": "6089be4ab506e11fd4150669",
  "A": {
  "text": "Операційні системи",
  "color": "#BED5AC"
  },
  "B": {
  "text": "Дискретна математика та математична логіка",
  "color": "#AEC0CA"
  },
  "C": {
  "text": "Програмування",
  "color": "#BED5AC"
  },
  "D": {
  "text": "Програмування + Курсова робота",
  "color": "#BED5AC"
  },
  "E": {
  "text": "Моделі та методи системного аналізу",
  "color": "#BED5AC"
  },
  "F": {
  "text": "Розробка мобільних додатків / Використання сучасних фреймворків для розробки мобільних додатків",
  "color": "#FBD1B9"
  },
  "G": {
  "text": "Основи криптографії. Технологія Blockchain",
  "color": "#AEC0CA"
  },
  "H": {
  "text": "Теорія ігор / Проблеми криптографії, оптимізації та аналізу ризиків",
  "color": "#FBD1B9"
  },
  "__v": 0
  },
  {
  "_id": "6089be51b506e11fd415066a",
  "A": {
  "text": "Вступ до програмування",
  "color": "#BED5AC"
  },
  "B": {
  "text": "Програмування",
  "color": "#BED5AC"
  },
  "C": {
  "text": "Клієнт-серверні технології обробки даних / Сучасні фреймворки для розробки Web-додатків",
  "color": "#FBD1B9"
  },
  "D": {
  "text": "Хмарні технології / Теорія автоматів",
  "color": "#FBD1B9"
  },
  "E": {
  "text": "Системне програмування",
  "color": "#BED5AC"
  },
  "F": {
  "text": "Моделі та методи системного аналізу (курсова робота включно)",
  "color": "#BED5AC"
  },
  "G": {
  "text": "Розробка Web додатків ASP.NET / Прийняття рішень при антикризовому управлінні",
  "color": "#FBD1B9"
  },
  "H": {
  "text": "Виробнича практика",
  "color": "#BED5AC"
  },
  "__v": 0
  },
  {
  "_id": "6089be59b506e11fd415066b",
  "A": {
  "text": "Алгоритми і структури даних",
  "color": "#BED5AC"
  },
  "B": {
  "text": "Основи WEB - програмування",
  "color": "#BED5AC"
  },
  "C": {
  "text": "Комп'ютерні мережі / Інформаційні технологї управління",
  "color": "#FBD1B9"
  },
  "D": {
  "text": "Бізнес-аналіз інформаційних процесів. Data Scraping / Комп'ютерні методи обробки соціально-економічних даних",
  "color": "#FBD1B9"
  },
  "E": {
  "text": "Вступ до автоматизації тестування /  Цифрова обробка інформації . Розпізнавання образів",
  "color": "#FBD1B9"
  },
  "F": {
  "text": "Виробнича практика",
  "color": "#BED5AC"
  },
  "G": {
  "text": "Фінансова математика / Управління в умовах ризику / Математичні моделі страхування",
  "color": "#FBD1B9"
  },
  "H": {
  "text": "Кваліфікаційна робота",
  "color": "#BED5AC"
  },
  "__v": 0
  },
  {
  "_id": "6089be5eb506e11fd415066c",
  "D": {
  "text": "Навчальна обчислювальна практика",
  "color": "#BED5AC"
  },
  "E": {
  "text": "Архітектура програмного забеспечення / Шаблони проектування/Розподілені обчислювальні системи",
  "color": "#FBD1B9"
  },
  "G": {
  "text": "Управління IT проектами / Спеціальне ПЗ для захисту операційних систем",
  "color": "#FBD1B9"
  },
  "__v": 0
  },
  {
    "_id": "6089be5eb506e11fd415066e",
    "A": {
    "text": "Гуманітарний блок",
    "color": "#FADF9D"
    },
    "B": {
      "text": "Фахові дисципліни",
      "color": "#BED5AC"
    },
    "C": {
      "text": "Нормативні дисципліни",
      "color": "#AEC0CA"
      },
    "D": {
      "text": "Фахові вибіркові дисципліни",
      "color": "#FBD1B9"
      },
    "__v": 0
    },
]
const analiz_danux = [
    {
    "_id": "6089a51a8d1cbb23fc19cefa",
    "A": {
    "text": "1 Семестр"
    },
    "B": {
    "text": "2 Семестр"
    },
    "C": {
    "text": "3 Семестр"
    },
    "D": {
    "text": "4 Семестр"
    },
    "E": {
    "text": "5 Семестр"
    },
    "F": {
    "text": "6 Семестр"
    },
    "G": {
    "text": "7 Семестр"
    },
    "H": {
    "text": "8 Семестр"
    },
    "__v": 0
    },
    {
    "_id": "6089a5578d1cbb23fc19cefb",
    "A": {
    "text": "Філософія",
    "color": "#FADF9D"
    },
    "B": {
    "text": "Ділова українська мова",
    "color": "#FADF9D"
    },
    "C": {
    "text": "Іноземна мова (англійська мова)",
    "color": "#FADF9D"
    },
    "D": {
    "text": "Іноземна мова(англійська мова)",
    "color": "#FADF9D"
    },
    "E": {
    "text": "Іноземна мова(англійська мова)",
    "color": "#FADF9D"
    },
    "F": {
    "text": "Охорона праці в IT індустрії/ Безпека життєдіяльності/ Англійська мова для професійної комунікації",
    "color": "#FADF9D"
    },
    "G": {
    "text": "Економіка / Основи логістики / Політологія  / Правознавство / Практичний курс англійської мови",
    "color": "#FADF9D"
    },
    "H": {
    "text": "Основи англомовного ділового спілкування / Бізнес-англійська",
    "color": "#FADF9D"
    },
    "__v": 0
    },
    {
    "_id": "6089a5608d1cbb23fc19cefc",
    "A": {
    "text": "Математичний аналіз",
    "color": "#AEC0CA"
    },
    "B": {
    "text": "Історія та культура України",
    "color": "#FADF9D"
    },
    "C": {
    "text": "Бізнес-аналіз / Технології розробки стартапів",
    "color": "#FADF9D"
    },
    "D": {
    "text": "Ораторське мистецтво та спічрайтинг / Ефективне лідерство",
    "color": "#FADF9D"
    },
    "E": {
    "text": "Чисельні методи та моделювання на ЕОМ",
    "color": "#BED5AC"
    },
    "F": {
    "text": "Моделі та методи системного аналізу (курсова робота включно)",
    "color": "#BED5AC"
    },
    "G": {
    "text": "Право інтелектуальної власності / Нормативо - правове забезпечення в IT індустрії",
    "color": "#FADF9D"
    },
    "H": {
    "text": "Аналіз даних (Big Data)",
    "color": "#BED5AC"
    },
    "__v": 0
    },
    {
    "_id": "6089a56a8d1cbb23fc19cefd",
    "A": {
    "text": "Алгебра і геометрія",
    "color": "#AEC0CA"
    },
    "B": {
    "text": "Математичний аналіз",
    "color": "#AEC0CA"
    },
    "C": {
    "text": "Математичний аналіз",
    "color": "#AEC0CA"
    },
    "D": {
    "text": "Теорія ймовірностей та математична статистика",
    "color": "#AEC0CA"
    },
    "E": {
    "text": "Методи оптимізації та дослідження операцій",
    "color": "#BED5AC"
    },
    "F": {
    "text": "Машинне навчання",
    "color": "#BED5AC"
    },
    "G": {
    "text": "Прийняття рішень в умовах нечіткості",
    "color": "#BED5AC"
    },
    "H": {
    "text": "Моделі та методи глибинного навчання",
    "color": "#BED5AC"
    },
    "__v": 0
    },
    {
    "_id": "6089a5738d1cbb23fc19cefe",
    "A": {
    "text": "Дискретна математика та математична логіка",
    "color": "#AEC0CA"
    },
    "B": {
    "text": "Алгебра і геометрія",
    "color": "#AEC0CA"
    },
    "C": {
    "text": "Диференціальні рівняння",
    "color": "#AEC0CA"
    },
    "D": {
    "text": "Комп'ютерне моделювання",
    "color": "#AEC0CA"
    },
    "E": {
    "text": "Основи захисту інформації",
    "color": "#BED5AC"
    },
    "F": {
    "text": "Системи та методи прийняття рішень",
    "color": "#BED5AC"
    },
    "G": {
    "text": "Цифрова обробка інформації та розпізнавання образів",
    "color": "#BED5AC"
    },
    "H": {
    "text": "Роль комунікацій в управлінні проектами / Соціологія конфлікту / IT для обробки і аналізу соціологічних досліджень",
    "color": "#FBD1B9"
    },
    "__v": 0
    },
    {
    "_id": "6089a57b8d1cbb23fc19ceff",
    "A": {
    "text": "Операційні системи",
    "color": "#BED5AC"
    },
    "B": {
    "text": "Дискретна математика та математична логіка",
    "color": "#AEC0CA"
    },
    "C": {
    "text": "База даних та проектування інформаційних систем",
    "color": "#BED5AC"
    },
    "D": {
    "text": "Програмування + Курсова робота",
    "color": "#BED5AC"
    },
    "E": {
    "text": "Архітектура обчислювальних систем",
    "color": "#BED5AC"
    },
    "F": {
    "text": "Використання сучасних комп'ютерних систем моделювання / 3D моделювання. Unity 3D",
    "color": "#FBD1B9"
    },
    "G": {
    "text": "Вступ до автоматизації тестування",
    "color": "#BED5AC"
    },
    "H": {
    "text": "Опрацювання інформації та візуалізації даних / Сучасні бібліотеки та підходи до аналізу даних у веб-додатках",
    "color": "#FBD1B9"
    },
    "__v": 0
    },
    {
    "_id": "6089a5838d1cbb23fc19cf00",
    "A": {
    "text": "Вступ до програмування",
    "color": "#BED5AC"
    },
    "B": {
    "text": "Програмування",
    "color": "#BED5AC"
    },
    "C": {
    "text": "Програмування",
    "color": "#BED5AC"
    },
    "D": {
    "text": "Хмарні технології / Теорія автоматів",
    "color": "#FBD1B9"
    },
    "E": {
    "text": "Системне програмування / Розподілені обчислювальні системи",
    "color": "#FBD1B9"
    },
    "F": {
    "text": "Розробка мобільних додатків / Використання сучасних фреймворків для розробки мобільних додатків",
    "color": "#FBD1B9"
    },
    "G": {
    "text": "Основи криптографії. Технологія Blockchain",
    "color": "#BED5AC"
    },
    "H": {
    "text": "Виробнича практика",
    "color": "#BED5AC"
    },
    "__v": 0
    },
    {
    "_id": "6089a58c8d1cbb23fc19cf01",
    "A": {
    "text": "Алгоритми і структури даних",
    "color": "#BED5AC"
    },
    "B": {
    "text": "Основи WEB - програмування",
    "color": "#BED5AC"
    },
    "C": {
    "text": "Клієнт-серверні технології обробки даних / Сучасні фреймворки для розробки Web-додатків",
    "color": "#FBD1B9"
    },
    "D": {
    "text": "Бізнес-аналіз інформаційних процесів. Data Scraping / Комп'ютерні методи обробки соціально-економічних даних",
    "color": "#FBD1B9"
    },
    "E": {
    "text": "Нереляційні бази даних / Розробка Web додатків ASP.NET",
    "color": "#FBD1B9"
    },
    "F": {
    "text": "Виробнича практика",
    "color": "#BED5AC"
    },
    "G": {
    "text": "Фінансова математика / Управління в умовах ризику / Математичні моделі страхування",
    "color": "#FBD1B9"
    },
    "H": {
    "text": "Кваліфікаційна робота",
    "color": "#BED5AC"
    },
    "__v": 0
    },
    {
    "_id": "6089a5948d1cbb23fc19cf02",
    "D": {
    "text": "Навчальна обчислювальна практика",
    "color": "#BED5AC"
    },
    "E": {
    "text": "Архітектура програмного забеспечення / Шаблони проектування",
    "color": "#FBD1B9"
    },
    "G": {
    "text": "Управління IT проектами / Спеціальне ПЗ для захисту операційних систем",
    "color": "#FBD1B9"
    },
    "__v": 0
    },
    {
      "_id": "6089a5948d1cbb23fc19cf03",
      "A": {
      "text": "Гуманітарний блок",
      "color": "#FADF9D"
      },
      "B": {
        "text": "Фахові дисципліни",
        "color": "#BED5AC"
      },
      "C": {
        "text": "Нормативні дисципліни",
        "color": "#AEC0CA"
        },
      "D": {
        "text": "Фахові вибіркові дисципліни",
        "color": "#FBD1B9"
        },
      "__v": 0
      },
    ]
const magistr = [
    {
    "_id": "608aabea2fdb3f1ba8ed5151",
    "A": {
    "text": "1 Семестр"
    },
    "B": {
    "text": "2 Семестр"
    },
    "C": {
    "text": "3 Семестр"
    },
    "__v": 0
    },
    {
    "_id": "608aabf22fdb3f1ba8ed5152",
    "A": {
    "text": "Англійська мова в IT",
    "color": "#FADF9D"
    },
    "B": {
    "text": "Математичні методи прийняття рішень в умовах невизначеності",
    "color": "#BED5AC"
    },
    "C": {
    "text": "Виробнича практика (4 тижнів)",
    "color": "#BED5AC"
    },
    "__v": 0
    },
    {
    "_id": "608aabfd2fdb3f1ba8ed5153",
    "A": {
    "text": "Методи аналізу великих даних",
    "color": "#BED5AC"
    },
    "B": {
    "text": "Задачі прикладного системного аналізу",
    "color": "#BED5AC"
    },
    "C": {
    "text": "Переддипломна практика (3 тижні)",
    "color": "#BED5AC"
    },
    "__v": 0
    },
    {
    "_id": "608aac072fdb3f1ba8ed5154",
    "A": {
    "text": "Системи обробки зображень та комп'ютерний зір",
    "color": "#BED5AC"
    },
    "B": {
    "text": "Статистичні методи. Big Data",
    "color": "#BED5AC"
    },
    "C": {
    "text": "Виконання кваліфікаційної магістерської роботи із захистом в ЕК",
    "color": "#BED5AC"
    },
    "__v": 0
    },
    {
    "_id": "608aac102fdb3f1ba8ed5155",
    "A": {
    "text": "Методологія та організація наукових досліджень",
    "color": "#FADF9D"
    },
    "B": {
    "text": "Комплекснозначні нейромережі. Deep Learning",
    "color": "#BED5AC"
    },
    "__v": 0
    },
    {
    "_id": "608aac162fdb3f1ba8ed5156",
    "A": {
    "text": "Моделювання процесів аналізу даних",
    "color": "#BED5AC"
    },
    "B": {
    "text": "Комунікативний менеджмент/ Конфліктологія/ Англійська мова для професійної комунікації",
    "color": "#FADF9D"
    },
    "__v": 0
    },
    {
    "_id": "608aac1f2fdb3f1ba8ed5157",
    "A": {
    "text": "Дисципліна із загальноуніверситетського каталогу",
    "color": "#FADF9D"
    },
    "B": {
    "text": "Економетрика/ Технологія розробки інформаційних продуктів/ Інформаційні системи і технології в наукових дослідженнях/ Хмарні обчислення",
    "color": "#FBD1B9"
    },
    "__v": 0
    },
    {
    "_id": "608aac282fdb3f1ba8ed5158",
    "A": {
    "text": "Спеціалізовані мови програмування/ Використання сучасних фреймворків у WEB розробці",
    "color": "#FBD1B9"
    },
    "B": {
    "text": "Обробка даних в Інтернеті речей/ Крос-платформенне програмування/ Використання сучасних фреймворків для розробки WEB-додатків",
    "color": "#FBD1B9"
    },
    "__v": 0
    },
    {
    "_id": "608aac2e2fdb3f1ba8ed5159",
    "A": {
    "text": "Технології розподілених систем та паралельних обчислень / Розподілені системи та управління великими даними",
    "color": "#FBD1B9"
    },
    "__v": 0
    },
    {
    "_id": "608aac2e2fdb3f1ba8ed5160",
    "A": {
    "text": "Гуманітарний блок",
    "color": "#FADF9D"
    },
    "B": {
      "text": "Фахові дисципліни",
      "color": "#BED5AC"
    },
    "С": {
      "text": "Фахові вибіркові дисципліни",
      "color": "#FBD1B9"
      },
    "__v": 0
    },
    ]
/* -----------------Courses------------------- */
 
createTable('6089a51a8d1cbb23fc19cefa',analiz_danux,"#tab_1");
createTable('6089be24b506e11fd4150664',system_analiz,"#tab_2");
createTable('608aabea2fdb3f1ba8ed5151',magistr,"#tab_3");




function crateHeadRow(row){
  let list = `<tr>
    <th>${checkUndefinedText(row["A"])}</th>
    <th>${checkUndefinedText(row["B"])}</th>
    <th>${checkUndefinedText(row["C"])}</th>
    <th>${checkUndefinedText(row["D"])}</th>
    <th>${checkUndefinedText(row["E"])}</th>
    <th>${checkUndefinedText(row["F"])}</th>
    <th>${checkUndefinedText(row["G"])}</th>
    <th>${checkUndefinedText(row["H"])}</th>
    </tr>`

  return list;
  
}

function crateRow(row){
  let list = `<tr>
    <td style="background:${checkUndefinedColor(row["A"])};">${checkUndefinedText(row["A"])}</td>
    <td style="background:${checkUndefinedColor(row["B"])};">${checkUndefinedText(row["B"])}</td>
    <td style="background:${checkUndefinedColor(row["C"])};">${checkUndefinedText(row["C"])}</td>
    <td style="background:${checkUndefinedColor(row["D"])};">${checkUndefinedText(row["D"])}</td>
    <td style="background:${checkUndefinedColor(row["E"])};">${checkUndefinedText(row["E"])}</td>
    <td style="background:${checkUndefinedColor(row["F"])};">${checkUndefinedText(row["F"])}</td>
    <td style="background:${checkUndefinedColor(row["G"])};">${checkUndefinedText(row["G"])}</td>
    <td style="background:${checkUndefinedColor(row["H"])};">${checkUndefinedText(row["H"])}</td>
    </tr>`
  return list;
}
  /* Func for transform undefind returns from API*/

function checkUndefinedColor(data){
  if(data == undefined){
    return "rgba(78, 78, 83,.1)";
  }
  else{
    return data["color"];
  }
}
function checkUndefinedText(data){
  if(data == undefined){
    return "";
  }
  else{
    return data["text"];
  }
}

function createTable(id,array,tab){
  let list ='';
  array.forEach(course=>{
    if(course['_id']==id){
      list += crateHeadRow(course);
    }
    if(course["_id"] !=id){
      list += crateRow(course);
    }
    $(tab).html(list);
  })
}


